In [1]:
import pandas as pd

students = pd.DataFrame({
    "Name": ["Arai", "West", "Masha", "Liza", "Adilya"],
    "Age":  [19, 21, 17, 20, 22],
    "Score":[90, 95, 88, 75, 80]
})

students

     Name  Age  Score
0    Arai   19     90
1    West   21     95
2   Masha   17     88
3    Liza   20     75
4  Adilya   22     80

In [2]:
students.head(3)

    Name  Age  Score
0   Arai   19     90
1   West   21     95
2  Masha   17     88

In [3]:
students.describe()

             Age      Score
count   5.000000   5.000000
mean   19.800000  85.600000
std     1.923538   8.018728
min    17.000000  75.000000
25%    19.000000  80.000000
50%    20.000000  88.000000
75%    21.000000  90.000000
max    22.000000  95.000000

In [4]:
avg_score = students["Score"].mean()
avg_score

np.float64(85.6)

In [5]:
older_than_20 = students[students["Age"] > 20]
older_than_20

     Name  Age  Score
1    West   21     95
4  Adilya   22     80

In [6]:
score_above_80 = students[students["Score"] > 80]
score_above_80

    Name  Age  Score
0   Arai   19     90
1   West   21     95
2  Masha   17     88